; ModuleID = 'test_hum_adc.c'
source_filename = "test_hum_adc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bme680_dev = type { i8, i8, i32, i8, i8, %struct.bme680_calib_data, %struct.bme680_tph_sett, %struct.bme680_gas_sett, i8, i8, i8, i8 (i8, i8, i8*, i16)*, i8 (i8, i8, i8*, i16)*, void (i32)*, i8 }
%struct.bme680_calib_data = type { i32, i16, i8, i32, i8, i32, i8, i8, i16, i8, i16, i16, i8, i16, i16, i8, i16, i16, i8, i8, i16, i16, i8, i32, i8, i8, i8 }
%struct.bme680_tph_sett = type { i8, i8, i8, i8 }
%struct.bme680_gas_sett = type { i8, i8, i8, i16, i16 }

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @user_delay_ms(i32 %0) #0 !dbg !22 {
  %2 = alloca i32, align 4
  store i32 %0, i32* %2, align 4
  call void @llvm.dbg.declare(metadata i32* %2, metadata !26, metadata !DIExpression()), !dbg !27
  ret void, !dbg !28
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local signext i8 @user_i2c_read(i8 zeroext %0, i8 zeroext %1, i8* %2, i16 zeroext %3) #0 !dbg !29 {
  %5 = alloca i8, align 1
  %6 = alloca i8, align 1
  %7 = alloca i8*, align 8
  %8 = alloca i16, align 2
  %9 = alloca i8, align 1
  store i8 %0, i8* %5, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "test_hum_adc.c", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/adc_test")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bme680_intf", file: !4, line: 359, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./bme680_defs.h", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/adc_test")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "BME680_SPI_INTF", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "BME680_I2C_INTF", value: 1, isUnsigned: true)
!9 = !{!10, !15}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !11, line: 26, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !13, line: 41, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !13, line: 42, baseType: !5)
!18 = !{i32 7, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{i32 1, !"wchar_size", i32 4}
!21 = !{!"Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11"}
!22 = distinct !DISubprogram(name: "user_delay_ms", scope: !1, file: !1, line: 5, type: !23, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !25)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !15}
!25 = !{}
!26 = !DILocalVariable(name: "period", arg: 1, scope: !22, file: !1, line: 5, type: !15)
!27 = !DILocation(line: 5, column: 29, scope: !22)
!28 = !DILocation(line: 11, column: 1, scope: !22)
!29 = distinct !DISubprogram(name: "user_i2c_read", scope: !1, file: !1, line: 13, type: !30, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !25)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !35, !35, !38, !39}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !11, line: 24, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !13, line: 37, baseType: !34)
!34 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 38, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 25, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 40, baseType: !41)
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !DILocalVariable(name: "dev_id", arg: 1, scope: !29, file: !1, line: 13, type: !35)
!43 = !DILocation(line: 13, column: 30, scope: !29)
!44 = !DILocalVariable(name: "reg_addr", arg: 2, scope: !29, file: !1, line: 13, type: !35)
!45 = !DILocation(line: 13, column: 46, scope: !29)
!46 = !DILocalVariable(name: "reg_data", arg: 3, scope: !29, file: !1, line: 13, type: !38)
!47 = !DILocation(line: 13, column: 65, scope: !29)
!48 = !DILocalVariable(name: "len", arg: 4, scope: !29, file: !1, line: 13, type: !39)
!49 = !DILocation(line: 13, column: 84, scope: !29)
!50 = !DILocalVariable(name: "rslt", scope: !29, file: !1, line: 15, type: !32)
!51 = !DILocation(line: 15, column: 12, scope: !29)
!52 = !DILocation(line: 37, column: 12, scope: !29)
!53 = !DILocation(line: 37, column: 5, scope: !29)
!54 = distinct !DISubprogram(name: "user_i2c_write", scope: !1, file: !1, line: 41, type: !30, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !25)
!55 = !DILocalVariable(name: "dev_id", arg: 1, scope: !54, file: !1, line: 41, type: !35)
!56 = !DILocation(line: 41, column: 31, scope: !54)
!57 = !DILocalVariable(name: "reg_addr", arg: 2, scope: !54, file: !1, line: 41, type: !35)
!58 = !DILocation(line: 41, column: 47, scope: !54)
!59 = !DILocalVariable(name: "reg_data", arg: 3, scope: !54, file: !1, line: 41, type: !38)
!60 = !DILocation(line: 41, column: 66, scope: !54)
!61 = !DILocalVariable(name: "len", arg: 4, scope: !54, file: !1, line: 41, type: !39)
!62 = !DILocation(line: 41, column: 85, scope: !54)
!63 = !DILocalVariable(name: "rslt", scope: !54, file: !1, line: 43, type: !32)
!64 = !DILocation(line: 43, column: 12, scope: !54)
!65 = !DILocation(line: 63, column: 12, scope: !54)
!66 = !DILocation(line: 63, column: 5, scope: !54)
!67 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 105, type: !68, scopeLine: 105, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !25)
!68 = !DISubroutineType(types: !69)
!69 = !{!14}
!70 = !DILocalVariable(name: "gas_sensor", scope: !67, file: !1, line: 106, type: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bme680_dev", file: !4, line: 502, size: 960, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !120, !127, !135, !136, !137, !138, !141, !142, !145}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "chip_id", scope: !71, file: !4, line: 504, baseType: !35, size: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dev_id", scope: !71, file: !4, line: 506, baseType: !35, size: 8, offset: 8)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "intf", scope: !71, file: !4, line: 508, baseType: !3, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mem_page", scope: !71, file: !4, line: 510, baseType: !35, size: 8, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "amb_temp", scope: !71, file: !4, line: 512, baseType: !32, size: 8, offset: 72)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "calib", scope: !71, file: !4, line: 514, baseType: !79, size: 480, offset: 96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bme680_calib_data", file: !4, line: 404, size: 480, elements: !80)
!80 = !{!81, !84, !86, !88, !90, !92, !94, !96, !97, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !117, !118, !119}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "par_h1", scope: !79, file: !4, line: 406, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "voltage", file: !83, line: 15, baseType: !10)
!83 = !DIFile(filename: "./signalTypedef.h", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/adc_test")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "par_h2", scope: !79, file: !4, line: 408, baseType: !85, size: 16, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "relativeHumidityPerVoltageTemperatureSquaredDimension", file: !83, line: 10, baseType: !39)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "par_h3", scope: !79, file: !4, line: 410, baseType: !87, size: 8, offset: 48)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoltagePerTemperatureDimension", file: !83, line: 6, baseType: !32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "par_h4", scope: !79, file: !4, line: 412, baseType: !89, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "temperature", file: !83, line: 14, baseType: !10)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "par_h5", scope: !79, file: !4, line: 414, baseType: !91, size: 8, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "unitless", file: !83, line: 7, baseType: !32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "par_h6", scope: !79, file: !4, line: 416, baseType: !93, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "relativeHumidity", file: !83, line: 12, baseType: !10)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "par_h7", scope: !79, file: !4, line: 418, baseType: !95, size: 8, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "relativeHumidityPerTemperature", file: !83, line: 8, baseType: !32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "par_gh1", scope: !79, file: !4, line: 420, baseType: !32, size: 8, offset: 168)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "par_gh2", scope: !79, file: !4, line: 422, baseType: !98, size: 16, offset: 176)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !11, line: 25, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !13, line: 39, baseType: !100)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "par_gh3", scope: !79, file: !4, line: 424, baseType: !32, size: 8, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "par_t1", scope: !79, file: !4, line: 426, baseType: !39, size: 16, offset: 208)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "par_t2", scope: !79, file: !4, line: 428, baseType: !98, size: 16, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "par_t3", scope: !79, file: !4, line: 430, baseType: !32, size: 8, offset: 240)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "par_p1", scope: !79, file: !4, line: 432, baseType: !39, size: 16, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "par_p2", scope: !79, file: !4, line: 434, baseType: !98, size: 16, offset: 272)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "par_p3", scope: !79, file: !4, line: 436, baseType: !32, size: 8, offset: 288)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "par_p4", scope: !79, file: !4, line: 438, baseType: !98, size: 16, offset: 304)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "par_p5", scope: !79, file: !4, line: 440, baseType: !98, size: 16, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "par_p6", scope: !79, file: !4, line: 442, baseType: !32, size: 8, offset: 336)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "par_p7", scope: !79, file: !4, line: 444, baseType: !32, size: 8, offset: 344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "par_p8", scope: !79, file: !4, line: 446, baseType: !98, size: 16, offset: 352)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "par_p9", scope: !79, file: !4, line: 448, baseType: !98, size: 16, offset: 368)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "par_p10", scope: !79, file: !4, line: 450, baseType: !35, size: 8, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "t_fine", scope: !79, file: !4, line: 454, baseType: !116, size: 32, offset: 416)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoltageSquaredDimension", file: !83, line: 16, baseType: !10)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "res_heat_range", scope: !79, file: !4, line: 460, baseType: !35, size: 8, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "res_heat_val", scope: !79, file: !4, line: 462, baseType: !32, size: 8, offset: 456)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "range_sw_err", scope: !79, file: !4, line: 464, baseType: !32, size: 8, offset: 464)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tph_sett", scope: !71, file: !4, line: 516, baseType: !121, size: 32, offset: 576)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bme680_tph_sett", file: !4, line: 471, size: 32, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "os_hum", scope: !121, file: !4, line: 473, baseType: !35, size: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "os_temp", scope: !121, file: !4, line: 475, baseType: !35, size: 8, offset: 8)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "os_pres", scope: !121, file: !4, line: 477, baseType: !35, size: 8, offset: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !121, file: !4, line: 479, baseType: !35, size: 8, offset: 24)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "gas_sett", scope: !71, file: !4, line: 518, baseType: !128, size: 64, offset: 608)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bme680_gas_sett", file: !4, line: 486, size: 64, elements: !129)
!129 = !{!130, !131, !132, !133, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_conv", scope: !128, file: !4, line: 488, baseType: !35, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "heatr_ctrl", scope: !128, file: !4, line: 490, baseType: !35, size: 8, offset: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "run_gas", scope: !128, file: !4, line: 492, baseType: !35, size: 8, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "heatr_temp", scope: !128, file: !4, line: 494, baseType: !39, size: 16, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "heatr_dur", scope: !128, file: !4, line: 496, baseType: !39, size: 16, offset: 48)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "power_mode", scope: !71, file: !4, line: 520, baseType: !35, size: 8, offset: 672)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "new_fields", scope: !71, file: !4, line: 522, baseType: !35, size: 8, offset: 680)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "info_msg", scope: !71, file: !4, line: 524, baseType: !35, size: 8, offset: 688)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !71, file: !4, line: 526, baseType: !139, size: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "bme680_com_fptr_t", file: !4, line: 348, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !71, file: !4, line: 528, baseType: !139, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "delay_ms", scope: !71, file: !4, line: 530, baseType: !143, size: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "bme680_delay_fptr_t", file: !4, line: 354, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "com_rslt", scope: !71, file: !4, line: 532, baseType: !32, size: 8, offset: 896)
!146 = !DILocation(line: 106, column: 20, scope: !67)
!147 = !DILocation(line: 108, column: 13, scope: !67)
!148 = !DILocation(line: 108, column: 20, scope: !67)
!149 = !DILocation(line: 109, column: 13, scope: !67)
!150 = !DILocation(line: 109, column: 18, scope: !67)
!151 = !DILocation(line: 110, column: 13, scope: !67)
!152 = !DILocation(line: 110, column: 18, scope: !67)
!153 = !DILocation(line: 111, column: 13, scope: !67)
!154 = !DILocation(line: 111, column: 19, scope: !67)
!155 = !DILocation(line: 112, column: 13, scope: !67)
!156 = !DILocation(line: 112, column: 22, scope: !67)
!157 = !DILocation(line: 116, column: 13, scope: !67)
!158 = !DILocation(line: 116, column: 22, scope: !67)
!159 = !DILocalVariable(name: "rslt", scope: !67, file: !1, line: 118, type: !32)
!160 = !DILocation(line: 118, column: 9, scope: !67)
!161 = !DILocation(line: 119, column: 9, scope: !67)
!162 = !DILocation(line: 119, column: 7, scope: !67)
!163 = !DILocalVariable(name: "temp_adc", scope: !67, file: !1, line: 121, type: !15)
!164 = !DILocation(line: 121, column: 11, scope: !67)
!165 = !DILocation(line: 122, column: 16, scope: !67)
!166 = !DILocation(line: 122, column: 2, scope: !67)
!167 = !DILocation(line: 124, column: 1, scope: !67)
!168 = distinct !DISubprogram(name: "calc_humidity", scope: !1, file: !1, line: 67, type: !169, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !25)
!169 = !DISubroutineType(types: !170)
!170 = !{!15, !82, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!173 = !DILocalVariable(name: "hum_adc", arg: 1, scope: !168, file: !1, line: 67, type: !82)
!174 = !DILocation(line: 67, column: 39, scope: !168)
!175 = !DILocalVariable(name: "dev", arg: 2, scope: !168, file: !1, line: 67, type: !171)
!176 = !DILocation(line: 67, column: 73, scope: !168)
!177 = !DILocalVariable(name: "var1", scope: !168, file: !1, line: 69, type: !82)
!178 = !DILocation(line: 69, column: 10, scope: !168)
!179 = !DILocalVariable(name: "var2", scope: !168, file: !1, line: 70, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "relativeHumidityPerVoltage", file: !83, line: 13, baseType: !10)
!181 = !DILocation(line: 70, column: 29, scope: !168)
!182 = !DILocalVariable(name: "var3", scope: !168, file: !1, line: 71, type: !93)
!183 = !DILocation(line: 71, column: 19, scope: !168)
!184 = !DILocalVariable(name: "var4", scope: !168, file: !1, line: 72, type: !93)
!185 = !DILocation(line: 72, column: 19, scope: !168)
!186 = !DILocalVariable(name: "var5", scope: !168, file: !1, line: 73, type: !93)
!187 = !DILocation(line: 73, column: 19, scope: !168)
!188 = !DILocalVariable(name: "var6", scope: !168, file: !1, line: 74, type: !93)
!189 = !DILocation(line: 74, column: 19, scope: !168)
!190 = !DILocalVariable(name: "temp_scaled", scope: !168, file: !1, line: 75, type: !89)
!191 = !DILocation(line: 75, column: 14, scope: !168)
!192 = !DILocalVariable(name: "calc_hum", scope: !168, file: !1, line: 76, type: !93)
!193 = !DILocation(line: 76, column: 19, scope: !168)
!194 = !DILocalVariable(name: "unitHavingConstant1", scope: !168, file: !1, line: 78, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "temperaturePerVoltageSquaredDimension", file: !83, line: 18, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !11, line: 27, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !13, line: 44, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DILocation(line: 78, column: 41, scope: !168)
!200 = !DILocalVariable(name: "unitHavingConstant2", scope: !168, file: !1, line: 79, type: !201)
