; ModuleID = 'main.ll'
source_filename = "main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [20 x i8] c"Input filename: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [27 x i8] c"Error opening input file.\0A\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"Reading from file...\0A\00", align 1
@.str.4 = private unnamed_addr constant [28 x i8] c"Performing measurements...\0A\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"%G,%G,%G,%G,%*G\0A\00", align 1
@.str.6 = private unnamed_addr constant [62 x i8] c"Unable to read row. Possible problem with input data format.\0A\00", align 1
@.str.7 = private unnamed_addr constant [33 x i8] c"They took %d steps, %d strides.\0A\00", align 1
@.str.8 = private unnamed_addr constant [31 x i8] c"Measurement count total : %d.\0A\00", align 1

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/pedometer")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11"}
!9 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 49, type: !10, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !12, !13}
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocalVariable(name: "argc", arg: 1, scope: !9, file: !1, line: 49, type: !12)
!17 = !DILocation(line: 0, scope: !9)
!18 = !DILocalVariable(name: "argv", arg: 2, scope: !9, file: !1, line: 49, type: !13)
!19 = !DILocalVariable(name: "charBuffer", scope: !9, file: !1, line: 51, type: !20)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1200, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 150)
!23 = !DILocation(line: 51, column: 7, scope: !9)
!24 = !DILocation(line: 54, column: 33, scope: !9)
!25 = !DILocation(line: 54, column: 2, scope: !9)
!26 = !DILocation(line: 56, column: 20, scope: !9)
!27 = !DILocation(line: 56, column: 14, scope: !9)
!28 = !DILocalVariable(name: "inputFile", scope: !9, file: !1, line: 52, type: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 7, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !33, line: 49, size: 1728, elements: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !50, !52, !53, !54, !58, !60, !62, !66, !69, !71, !74, !77, !78, !79, !83, !84}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !33, line: 51, baseType: !12, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !32, file: !33, line: 54, baseType: !14, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !32, file: !33, line: 55, baseType: !14, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !32, file: !33, line: 56, baseType: !14, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !32, file: !33, line: 57, baseType: !14, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !32, file: !33, line: 58, baseType: !14, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !32, file: !33, line: 59, baseType: !14, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !32, file: !33, line: 60, baseType: !14, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !32, file: !33, line: 61, baseType: !14, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !32, file: !33, line: 64, baseType: !14, size: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !32, file: !33, line: 65, baseType: !14, size: 64, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !32, file: !33, line: 66, baseType: !14, size: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !32, file: !33, line: 68, baseType: !48, size: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !33, line: 36, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !32, file: !33, line: 70, baseType: !51, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !32, file: !33, line: 72, baseType: !12, size: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !33, line: 73, baseType: !12, size: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !32, file: !33, line: 74, baseType: !55, size: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 152, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!57 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !32, file: !33, line: 77, baseType: !59, size: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !32, file: !33, line: 78, baseType: !61, size: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !32, file: !33, line: 79, baseType: !63, size: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !33, line: 81, baseType: !67, size: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !33, line: 43, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !33, line: 89, baseType: !70, size: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 153, baseType: !57)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !32, file: !33, line: 91, baseType: !72, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !33, line: 37, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !32, file: !33, line: 92, baseType: !75, size: 64, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !33, line: 38, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !32, file: !33, line: 93, baseType: !51, size: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !32, file: !33, line: 94, baseType: !4, size: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !32, file: !33, line: 95, baseType: !80, size: 64, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !32, file: !33, line: 96, baseType: !12, size: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !32, file: !33, line: 98, baseType: !85, size: 160, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !DILocation(line: 57, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !9, file: !1, line: 57, column: 6)
!90 = !DILocation(line: 57, column: 6, scope: !9)
!91 = !DILocation(line: 59, column: 11, scope: !92)
!92 = distinct !DILexicalBlock(scope: !89, file: !1, line: 58, column: 2)
!93 = !DILocation(line: 59, column: 3, scope: !92)
!94 = !DILocation(line: 60, column: 3, scope: !92)
!95 = !DILocation(line: 66, column: 2, scope: !9)
!96 = !DILocation(line: 66, column: 9, scope: !9)
!97 = !DILocation(line: 66, column: 26, scope: !9)
!98 = distinct !{!98, !95, !99, !100}
!99 = !DILocation(line: 66, column: 34, scope: !9)
!100 = !{!"llvm.loop.mustprogress"}
!101 = !DILocation(line: 67, column: 2, scope: !9)
!102 = !DILocalVariable(name: "reachedEOF", scope: !9, file: !1, line: 69, type: !12)
!103 = !DILocalVariable(name: "measurementCount", scope: !9, file: !1, line: 71, type: !12)
!104 = !DILocalVariable(name: "DCEstimateCounter", scope: !9, file: !1, line: 72, type: !12)
!105 = !DILocalVariable(name: "reset", scope: !9, file: !1, line: 74, type: !12)
!106 = !DILocalVariable(name: "steps", scope: !9, file: !1, line: 75, type: !12)
!107 = !DILocalVariable(name: "strides", scope: !9, file: !1, line: 76, type: !12)
!108 = !DILocalVariable(name: "inStride", scope: !9, file: !1, line: 77, type: !12)
!109 = !DILocalVariable(name: "stepProbability", scope: !9, file: !1, line: 79, type: !110)
!110 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!111 = !DILocalVariable(name: "stepIntersectionProbability", scope: !9, file: !1, line: 80, type: !110)
!112 = !DILocation(line: 80, column: 8, scope: !9)
!113 = !DILocalVariable(name: "fSteps", scope: !9, file: !1, line: 81, type: !110)
!114 = !DILocalVariable(name: "bernoulliSum", scope: !9, file: !1, line: 82, type: !110)
!115 = !DILocalVariable(name: "poissonBinomialAccum", scope: !9, file: !1, line: 83, type: !110)
!116 = !DILocalVariable(name: "timestampPrevious", scope: !9, file: !1, line: 86, type: !110)
!117 = !DILocalVariable(name: "fTimestampPrevious", scope: !9, file: !1, line: 87, type: !110)
!118 = !DILocation(line: 87, column: 8, scope: !9)
!119 = !DILocalVariable(name: "timestampSamples", scope: !9, file: !1, line: 92, type: !120)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DILocation(line: 92, column: 8, scope: !9)
!124 = !DILocalVariable(name: "xSamples", scope: !9, file: !1, line: 93, type: !120)
!125 = !DILocation(line: 93, column: 8, scope: !9)
!126 = !DILocalVariable(name: "ySamples", scope: !9, file: !1, line: 94, type: !120)
!127 = !DILocation(line: 94, column: 8, scope: !9)
!128 = !DILocalVariable(name: "zSamples", scope: !9, file: !1, line: 95, type: !120)
!129 = !DILocation(line: 95, column: 8, scope: !9)
!130 = !DILocalVariable(name: "xDCSamples", scope: !9, file: !1, line: 96, type: !131)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1536, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 48)
!134 = !DILocation(line: 96, column: 8, scope: !9)
!135 = !DILocalVariable(name: "yDCSamples", scope: !9, file: !1, line: 97, type: !131)
!136 = !DILocation(line: 97, column: 8, scope: !9)
!137 = !DILocalVariable(name: "zDCSamples", scope: !9, file: !1, line: 98, type: !131)
!138 = !DILocation(line: 98, column: 8, scope: !9)
!139 = !DILocalVariable(name: "max_x", scope: !9, file: !1, line: 108, type: !110)
!140 = !DILocalVariable(name: "max_y", scope: !9, file: !1, line: 109, type: !110)
!141 = !DILocalVariable(name: "max_z", scope: !9, file: !1, line: 110, type: !110)
!142 = !DILocalVariable(name: "min_x", scope: !9, file: !1, line: 111, type: !110)
