; ModuleID = 'main_output.bc'
source_filename = "main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"%G,%G,%G,%G,%*G\0A\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [62 x i8] c"Unable to read row. Possible problem with input data format.\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"%lf\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main(i32 %0, i8** %1) #0 !dbg !7 {
  %3 = alloca [4 x float], align 16
  %4 = alloca [4 x float], align 16
  %5 = alloca [4 x float], align 16
  %6 = alloca [4 x float], align 16
  %7 = alloca %struct.timeval, align 8
  call void @llvm.dbg.value(metadata i32 %0, metadata !14, metadata !DIExpression()), !dbg !15

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/pedometer")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11"}
!7 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 50, type: !8, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !7, file: !1, line: 50, type: !10)
!15 = !DILocation(line: 0, scope: !7)
!16 = !DILocalVariable(name: "argv", arg: 2, scope: !7, file: !1, line: 50, type: !11)
!17 = !DILocalVariable(name: "charBuffer", scope: !7, file: !1, line: 52, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1200, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 150)
!21 = !DILocation(line: 52, column: 7, scope: !7)
!22 = !DILocation(line: 57, column: 20, scope: !7)
!23 = !DILocation(line: 57, column: 14, scope: !7)
!24 = !DILocalVariable(name: "inputFile", scope: !7, file: !1, line: 53, type: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 7, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !46, !48, !49, !50, !54, !56, !58, !62, !65, !67, !70, !73, !74, !76, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 51, baseType: !10, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 54, baseType: !12, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 55, baseType: !12, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 56, baseType: !12, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 57, baseType: !12, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 58, baseType: !12, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 59, baseType: !12, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 60, baseType: !12, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 61, baseType: !12, size: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 64, baseType: !12, size: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 65, baseType: !12, size: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 66, baseType: !12, size: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 36, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 70, baseType: !47, size: 64, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 72, baseType: !10, size: 32, offset: 896)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 73, baseType: !10, size: 32, offset: 928)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 74, baseType: !51, size: 64, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !52, line: 152, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!53 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 77, baseType: !55, size: 16, offset: 1024)
!55 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 78, baseType: !57, size: 8, offset: 1040)
!57 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 79, baseType: !59, size: 8, offset: 1048)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 81, baseType: !63, size: 64, offset: 1088)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 43, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 89, baseType: !66, size: 64, offset: 1152)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !52, line: 153, baseType: !53)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !28, file: !29, line: 91, baseType: !68, size: 64, offset: 1216)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !29, line: 37, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !28, file: !29, line: 92, baseType: !71, size: 64, offset: 1280)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !29, line: 38, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !28, file: !29, line: 93, baseType: !47, size: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !28, file: !29, line: 94, baseType: !75, size: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 95, baseType: !77, size: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 96, baseType: !10, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 98, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !DILocation(line: 67, column: 2, scope: !7)
!86 = !DILocation(line: 67, column: 9, scope: !7)
!87 = !DILocation(line: 67, column: 26, scope: !7)
!88 = distinct !{!88, !85, !89, !90}
!89 = !DILocation(line: 67, column: 34, scope: !7)
!90 = !{!"llvm.loop.mustprogress"}
!91 = !DILocalVariable(name: "reachedEOF", scope: !7, file: !1, line: 70, type: !10)
!92 = !DILocalVariable(name: "measurementCount", scope: !7, file: !1, line: 72, type: !10)
!93 = !DILocalVariable(name: "DCEstimateCounter", scope: !7, file: !1, line: 73, type: !10)
!94 = !DILocalVariable(name: "reset", scope: !7, file: !1, line: 75, type: !10)
!95 = !DILocalVariable(name: "steps", scope: !7, file: !1, line: 76, type: !10)
!96 = !DILocalVariable(name: "strides", scope: !7, file: !1, line: 77, type: !10)
!97 = !DILocalVariable(name: "inStride", scope: !7, file: !1, line: 78, type: !10)
!98 = !DILocalVariable(name: "stepProbability", scope: !7, file: !1, line: 80, type: !99)
!99 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!100 = !DILocalVariable(name: "stepIntersectionProbability", scope: !7, file: !1, line: 81, type: !99)
!101 = !DILocation(line: 81, column: 8, scope: !7)
!102 = !DILocalVariable(name: "fSteps", scope: !7, file: !1, line: 82, type: !99)
!103 = !DILocalVariable(name: "bernoulliSum", scope: !7, file: !1, line: 83, type: !99)
!104 = !DILocalVariable(name: "poissonBinomialAccum", scope: !7, file: !1, line: 84, type: !99)
!105 = !DILocalVariable(name: "timestampPrevious", scope: !7, file: !1, line: 87, type: !99)
!106 = !DILocalVariable(name: "fTimestampPrevious", scope: !7, file: !1, line: 88, type: !99)
!107 = !DILocation(line: 88, column: 8, scope: !7)
!108 = !DILocalVariable(name: "timestampSamples", scope: !7, file: !1, line: 93, type: !109)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 4)
!112 = !DILocation(line: 93, column: 8, scope: !7)
!113 = !DILocalVariable(name: "xSamples", scope: !7, file: !1, line: 94, type: !109)
!114 = !DILocation(line: 94, column: 8, scope: !7)
!115 = !DILocalVariable(name: "ySamples", scope: !7, file: !1, line: 95, type: !109)
!116 = !DILocation(line: 95, column: 8, scope: !7)
!117 = !DILocalVariable(name: "zSamples", scope: !7, file: !1, line: 96, type: !109)
!118 = !DILocation(line: 96, column: 8, scope: !7)
!119 = !DILocalVariable(name: "xDCSamples", scope: !7, file: !1, line: 97, type: !120)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 1536, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 48)
!123 = !DILocation(line: 97, column: 8, scope: !7)
!124 = !DILocalVariable(name: "yDCSamples", scope: !7, file: !1, line: 98, type: !120)
!125 = !DILocation(line: 98, column: 8, scope: !7)
!126 = !DILocalVariable(name: "zDCSamples", scope: !7, file: !1, line: 99, type: !120)
!127 = !DILocation(line: 99, column: 8, scope: !7)
!128 = !DILocalVariable(name: "max_x", scope: !7, file: !1, line: 109, type: !99)
!129 = !DILocalVariable(name: "max_y", scope: !7, file: !1, line: 110, type: !99)
!130 = !DILocalVariable(name: "max_z", scope: !7, file: !1, line: 111, type: !99)
!131 = !DILocalVariable(name: "min_x", scope: !7, file: !1, line: 112, type: !99)
!132 = !DILocalVariable(name: "min_y", scope: !7, file: !1, line: 113, type: !99)
!133 = !DILocalVariable(name: "min_z", scope: !7, file: !1, line: 114, type: !99)
!134 = !DILocalVariable(name: "threshold_x", scope: !7, file: !1, line: 115, type: !99)
!135 = !DILocalVariable(name: "threshold_y", scope: !7, file: !1, line: 116, type: !99)
!136 = !DILocalVariable(name: "threshold_z", scope: !7, file: !1, line: 117, type: !99)
!137 = !DILocalVariable(name: "measurementOld_x", scope: !7, file: !1, line: 119, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055xAcceleration", scope: !7, file: !1, line: 101, baseType: !99)
!139 = !DILocalVariable(name: "measurementOld_y", scope: !7, file: !1, line: 120, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055yAcceleration", scope: !7, file: !1, line: 102, baseType: !99)
!141 = !DILocalVariable(name: "measurementOld_z", scope: !7, file: !1, line: 121, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055zAcceleration", scope: !7, file: !1, line: 103, baseType: !99)
!143 = !DILocalVariable(name: "measurementNew_x", scope: !7, file: !1, line: 122, type: !138)
!144 = !DILocalVariable(name: "measurementNew_y", scope: !7, file: !1, line: 123, type: !140)
!145 = !DILocalVariable(name: "measurementNew_z", scope: !7, file: !1, line: 124, type: !142)
!146 = !DILocalVariable(name: "xDC", scope: !7, file: !1, line: 126, type: !99)
!147 = !DILocalVariable(name: "yDC", scope: !7, file: !1, line: 127, type: !99)
!148 = !DILocalVariable(name: "zDC", scope: !7, file: !1, line: 128, type: !99)
!149 = !DILocalVariable(name: "tv", scope: !7, file: !1, line: 134, type: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !151, line: 8, size: 128, elements: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !150, file: !151, line: 10, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !52, line: 160, baseType: !53)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !150, file: !151, line: 11, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !52, line: 162, baseType: !53)
!157 = !DILocation(line: 134, column: 17, scope: !7)
!158 = !DILocation(line: 135, column: 5, scope: !7)
!159 = !DILocation(line: 136, column: 20, scope: !7)
!160 = !DILocation(line: 136, column: 17, scope: !7)
!161 = !DILocation(line: 136, column: 41, scope: !7)
!162 = !DILocation(line: 136, column: 38, scope: !7)
!163 = !DILocation(line: 136, column: 36, scope: !7)
!164 = !DILocation(line: 136, column: 27, scope: !7)
!165 = !DILocalVariable(name: "t1", scope: !7, file: !1, line: 136, type: !166)
!166 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!167 = !DILocation(line: 138, column: 2, scope: !7)
!168 = !DILocalVariable(name: "timestamp", scope: !7, file: !1, line: 86, type: !99)
!169 = !DILocation(line: 138, column: 9, scope: !7)
!170 = !DILocation(line: 0, scope: !171)
!171 = distinct !DILexicalBlock(scope: !7, file: !1, line: 139, column: 2)
!172 = !DILocation(line: 0, scope: !173)
!173 = distinct !DILexicalBlock(scope: !171, file: !1, line: 153, column: 3)
!174 = !DILocalVariable(name: "i", scope: !173, file: !1, line: 153, type: !77)
!175 = !DILocalVariable(name: "samplesTaken", scope: !171, file: !1, line: 148, type: !10)
!176 = !DILocalVariable(name: "timestampAccum", scope: !171, file: !1, line: 147, type: !99)
!177 = !DILocalVariable(name: "acc_z", scope: !7, file: !1, line: 107, type: !142)
!178 = !DILocalVariable(name: "acc_y", scope: !7, file: !1, line: 106, type: !140)
!179 = !DILocalVariable(name: "acc_x", scope: !7, file: !1, line: 105, type: !138)
!180 = !DILocation(line: 153, column: 24, scope: !181)
!181 = distinct !DILexicalBlock(scope: !173, file: !1, line: 153, column: 3)
!182 = !DILocation(line: 153, column: 3, scope: !173)
!183 = !DILocation(line: 156, column: 60, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !1, line: 154, column: 3)
!185 = !DILocation(line: 156, column: 82, scope: !184)
!186 = !DILocation(line: 156, column: 96, scope: !184)
!187 = !DILocation(line: 156, column: 110, scope: !184)
!188 = !DILocation(line: 156, column: 20, scope: !184)
!189 = !DILocalVariable(name: "itemsRead", scope: !184, file: !1, line: 156, type: !10)
!190 = !DILocation(line: 0, scope: !184)
!191 = !DILocation(line: 157, column: 25, scope: !192)
!192 = distinct !DILexicalBlock(scope: !184, file: !1, line: 157, column: 8)
!193 = !DILocation(line: 167, column: 13, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !1, line: 166, column: 4)
!195 = distinct !DILexicalBlock(scope: !192, file: !1, line: 165, column: 13)
!196 = !DILocation(line: 167, column: 5, scope: !194)
!197 = !DILocation(line: 168, column: 4, scope: !194)
!198 = !DILocation(line: 170, column: 19, scope: !184)
!199 = !DILocation(line: 171, column: 16, scope: !184)
!200 = !DILocation(line: 176, column: 13, scope: !184)
!201 = !DILocation(line: 176, column: 10, scope: !184)
!202 = !DILocation(line: 177, column: 13, scope: !184)
!203 = !DILocation(line: 177, column: 10, scope: !184)
!204 = !DILocation(line: 178, column: 13, scope: !184)
!205 = !DILocation(line: 178, column: 10, scope: !184)
!206 = !DILocation(line: 179, column: 16, scope: !184)
!207 = !DILocation(line: 153, column: 52, scope: !181)
!208 = !DILocation(line: 153, column: 3, scope: !181)
!209 = distinct !{!209, !182, !210, !90}
!210 = !DILocation(line: 180, column: 3, scope: !173)
!211 = !DILocalVariable(name: "diff_z", scope: !171, file: !1, line: 195, type: !99)
!212 = !DILocation(line: 195, column: 9, scope: !171)
!213 = !DILocation(line: 201, column: 24, scope: !214)
!214 = distinct !DILexicalBlock(scope: !171, file: !1, line: 201, column: 7)
!215 = !DILocation(line: 201, column: 7, scope: !171)
!216 = !DILocation(line: 229, column: 19, scope: !217)
!217 = distinct !DILexicalBlock(scope: !171, file: !1, line: 229, column: 7)
