; ModuleID = 'main.ll'
source_filename = "main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [27 x i8] c"Error opening input file.\0A\00", align 1
@.str.2 = private unnamed_addr constant [17 x i8] c"%G,%G,%G,%G,%*G\0A\00", align 1
@.str.3 = private unnamed_addr constant [62 x i8] c"Unable to read row. Possible problem with input data format.\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%lf\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main(i32 %0, i8** %1) #0 !dbg !9 {
  %3 = alloca [4 x float], align 16
  %4 = alloca [4 x float], align 16
  %5 = alloca [4 x float], align 16
  %6 = alloca [4 x float], align 16
  %7 = alloca %struct.timeval, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "main.c", directory: "/home/blackgeorge/Noisy-lang-compiler/applications/newton/llvm-ir/pedometer")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11"}
!9 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 50, type: !10, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !12, !13}
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocalVariable(name: "argc", arg: 1, scope: !9, file: !1, line: 50, type: !12)
!17 = !DILocation(line: 0, scope: !9)
!18 = !DILocalVariable(name: "argv", arg: 2, scope: !9, file: !1, line: 50, type: !13)
!19 = !DILocalVariable(name: "charBuffer", scope: !9, file: !1, line: 52, type: !20)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1200, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 150)
!23 = !DILocation(line: 52, column: 7, scope: !9)
!24 = !DILocation(line: 57, column: 20, scope: !9)
!25 = !DILocation(line: 57, column: 14, scope: !9)
!26 = !DILocalVariable(name: "inputFile", scope: !9, file: !1, line: 53, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 7, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !77, !81, !82}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !31, line: 51, baseType: !12, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !30, file: !31, line: 54, baseType: !14, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !30, file: !31, line: 55, baseType: !14, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !30, file: !31, line: 56, baseType: !14, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !30, file: !31, line: 57, baseType: !14, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !30, file: !31, line: 58, baseType: !14, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !30, file: !31, line: 59, baseType: !14, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !30, file: !31, line: 60, baseType: !14, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !30, file: !31, line: 61, baseType: !14, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !30, file: !31, line: 64, baseType: !14, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !30, file: !31, line: 65, baseType: !14, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !30, file: !31, line: 66, baseType: !14, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !30, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !31, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !30, file: !31, line: 70, baseType: !49, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !30, file: !31, line: 72, baseType: !12, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !30, file: !31, line: 73, baseType: !12, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !30, file: !31, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !30, file: !31, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !30, file: !31, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !30, file: !31, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !30, file: !31, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !31, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !31, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !30, file: !31, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !31, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !30, file: !31, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !31, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !30, file: !31, line: 93, baseType: !49, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !30, file: !31, line: 94, baseType: !4, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !30, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !30, file: !31, line: 96, baseType: !12, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !30, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DILocation(line: 58, column: 16, scope: !87)
!87 = distinct !DILexicalBlock(scope: !9, file: !1, line: 58, column: 6)
!88 = !DILocation(line: 58, column: 6, scope: !9)
!89 = !DILocation(line: 60, column: 11, scope: !90)
!90 = distinct !DILexicalBlock(scope: !87, file: !1, line: 59, column: 2)
!91 = !DILocation(line: 60, column: 3, scope: !90)
!92 = !DILocation(line: 61, column: 3, scope: !90)
!93 = !DILocation(line: 67, column: 2, scope: !9)
!94 = !DILocation(line: 67, column: 9, scope: !9)
!95 = !DILocation(line: 67, column: 26, scope: !9)
!96 = distinct !{!96, !93, !97, !98}
!97 = !DILocation(line: 67, column: 34, scope: !9)
!98 = !{!"llvm.loop.mustprogress"}
!99 = !DILocalVariable(name: "reachedEOF", scope: !9, file: !1, line: 70, type: !12)
!100 = !DILocalVariable(name: "measurementCount", scope: !9, file: !1, line: 72, type: !12)
!101 = !DILocalVariable(name: "DCEstimateCounter", scope: !9, file: !1, line: 73, type: !12)
!102 = !DILocalVariable(name: "reset", scope: !9, file: !1, line: 75, type: !12)
!103 = !DILocalVariable(name: "steps", scope: !9, file: !1, line: 76, type: !12)
!104 = !DILocalVariable(name: "strides", scope: !9, file: !1, line: 77, type: !12)
!105 = !DILocalVariable(name: "inStride", scope: !9, file: !1, line: 78, type: !12)
!106 = !DILocalVariable(name: "stepProbability", scope: !9, file: !1, line: 80, type: !107)
!107 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!108 = !DILocalVariable(name: "stepIntersectionProbability", scope: !9, file: !1, line: 81, type: !107)
!109 = !DILocation(line: 81, column: 8, scope: !9)
!110 = !DILocalVariable(name: "fSteps", scope: !9, file: !1, line: 82, type: !107)
!111 = !DILocalVariable(name: "bernoulliSum", scope: !9, file: !1, line: 83, type: !107)
!112 = !DILocalVariable(name: "poissonBinomialAccum", scope: !9, file: !1, line: 84, type: !107)
!113 = !DILocalVariable(name: "timestampPrevious", scope: !9, file: !1, line: 87, type: !107)
!114 = !DILocalVariable(name: "fTimestampPrevious", scope: !9, file: !1, line: 88, type: !107)
!115 = !DILocation(line: 88, column: 8, scope: !9)
!116 = !DILocalVariable(name: "timestampSamples", scope: !9, file: !1, line: 93, type: !117)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DILocation(line: 93, column: 8, scope: !9)
!121 = !DILocalVariable(name: "xSamples", scope: !9, file: !1, line: 94, type: !117)
!122 = !DILocation(line: 94, column: 8, scope: !9)
!123 = !DILocalVariable(name: "ySamples", scope: !9, file: !1, line: 95, type: !117)
!124 = !DILocation(line: 95, column: 8, scope: !9)
!125 = !DILocalVariable(name: "zSamples", scope: !9, file: !1, line: 96, type: !117)
!126 = !DILocation(line: 96, column: 8, scope: !9)
!127 = !DILocalVariable(name: "xDCSamples", scope: !9, file: !1, line: 97, type: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1536, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 48)
!131 = !DILocation(line: 97, column: 8, scope: !9)
!132 = !DILocalVariable(name: "yDCSamples", scope: !9, file: !1, line: 98, type: !128)
!133 = !DILocation(line: 98, column: 8, scope: !9)
!134 = !DILocalVariable(name: "zDCSamples", scope: !9, file: !1, line: 99, type: !128)
!135 = !DILocation(line: 99, column: 8, scope: !9)
!136 = !DILocalVariable(name: "max_x", scope: !9, file: !1, line: 109, type: !107)
!137 = !DILocalVariable(name: "max_y", scope: !9, file: !1, line: 110, type: !107)
!138 = !DILocalVariable(name: "max_z", scope: !9, file: !1, line: 111, type: !107)
!139 = !DILocalVariable(name: "min_x", scope: !9, file: !1, line: 112, type: !107)
!140 = !DILocalVariable(name: "min_y", scope: !9, file: !1, line: 113, type: !107)
!141 = !DILocalVariable(name: "min_z", scope: !9, file: !1, line: 114, type: !107)
!142 = !DILocalVariable(name: "threshold_x", scope: !9, file: !1, line: 115, type: !107)
!143 = !DILocalVariable(name: "threshold_y", scope: !9, file: !1, line: 116, type: !107)
!144 = !DILocalVariable(name: "threshold_z", scope: !9, file: !1, line: 117, type: !107)
!145 = !DILocalVariable(name: "measurementOld_x", scope: !9, file: !1, line: 119, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055xAcceleration", scope: !9, file: !1, line: 101, baseType: !107)
!147 = !DILocalVariable(name: "measurementOld_y", scope: !9, file: !1, line: 120, type: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055yAcceleration", scope: !9, file: !1, line: 102, baseType: !107)
!149 = !DILocalVariable(name: "measurementOld_z", scope: !9, file: !1, line: 121, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmx055zAcceleration", scope: !9, file: !1, line: 103, baseType: !107)
!151 = !DILocalVariable(name: "measurementNew_x", scope: !9, file: !1, line: 122, type: !146)
!152 = !DILocalVariable(name: "measurementNew_y", scope: !9, file: !1, line: 123, type: !148)
!153 = !DILocalVariable(name: "measurementNew_z", scope: !9, file: !1, line: 124, type: !150)
!154 = !DILocalVariable(name: "xDC", scope: !9, file: !1, line: 126, type: !107)
!155 = !DILocalVariable(name: "yDC", scope: !9, file: !1, line: 127, type: !107)
!156 = !DILocalVariable(name: "zDC", scope: !9, file: !1, line: 128, type: !107)
!157 = !DILocalVariable(name: "tv", scope: !9, file: !1, line: 134, type: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !159, line: 8, size: 128, elements: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !158, file: !159, line: 10, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !54, line: 160, baseType: !55)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !158, file: !159, line: 11, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !54, line: 162, baseType: !55)
!165 = !DILocation(line: 134, column: 17, scope: !9)
!166 = !DILocation(line: 135, column: 5, scope: !9)
!167 = !DILocation(line: 136, column: 20, scope: !9)
!168 = !DILocation(line: 136, column: 17, scope: !9)
!169 = !DILocation(line: 136, column: 41, scope: !9)
!170 = !DILocation(line: 136, column: 38, scope: !9)
!171 = !DILocation(line: 136, column: 36, scope: !9)
!172 = !DILocation(line: 136, column: 27, scope: !9)
!173 = !DILocalVariable(name: "t1", scope: !9, file: !1, line: 136, type: !174)
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DILocation(line: 138, column: 2, scope: !9)
!176 = !DILocalVariable(name: "timestamp", scope: !9, file: !1, line: 86, type: !107)
!177 = !DILocation(line: 138, column: 9, scope: !9)
!178 = !DILocalVariable(name: "timestampAccum", scope: !179, file: !1, line: 147, type: !107)
!179 = distinct !DILexicalBlock(scope: !9, file: !1, line: 139, column: 2)
!180 = !DILocation(line: 0, scope: !179)
!181 = !DILocalVariable(name: "samplesTaken", scope: !179, file: !1, line: 148, type: !12)
!182 = !DILocalVariable(name: "acc_x", scope: !9, file: !1, line: 105, type: !146)
!183 = !DILocalVariable(name: "acc_y", scope: !9, file: !1, line: 106, type: !148)
!184 = !DILocalVariable(name: "acc_z", scope: !9, file: !1, line: 107, type: !150)
!185 = !DILocalVariable(name: "i", scope: !186, file: !1, line: 153, type: !78)
!186 = distinct !DILexicalBlock(scope: !179, file: !1, line: 153, column: 3)
!187 = !DILocation(line: 0, scope: !186)
!188 = !DILocation(line: 153, column: 8, scope: !186)
!189 = !DILocation(line: 153, column: 24, scope: !190)
!190 = distinct !DILexicalBlock(scope: !186, file: !1, line: 153, column: 3)
!191 = !DILocation(line: 153, column: 3, scope: !186)
!192 = !DILocation(line: 156, column: 60, scope: !193)
!193 = distinct !DILexicalBlock(scope: !190, file: !1, line: 154, column: 3)
!194 = !DILocation(line: 156, column: 82, scope: !193)
!195 = !DILocation(line: 156, column: 96, scope: !193)
!196 = !DILocation(line: 156, column: 110, scope: !193)
!197 = !DILocation(line: 156, column: 20, scope: !193)
!198 = !DILocalVariable(name: "itemsRead", scope: !193, file: !1, line: 156, type: !12)
!199 = !DILocation(line: 0, scope: !193)
!200 = !DILocation(line: 157, column: 18, scope: !201)
!201 = distinct !DILexicalBlock(scope: !193, file: !1, line: 157, column: 8)
!202 = !DILocation(line: 157, column: 25, scope: !201)
!203 = !DILocation(line: 157, column: 38, scope: !201)
!204 = !DILocation(line: 157, column: 8, scope: !193)
!205 = !DILocation(line: 163, column: 5, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !1, line: 158, column: 4)
!207 = !DILocation(line: 165, column: 23, scope: !208)
!208 = distinct !DILexicalBlock(scope: !201, file: !1, line: 165, column: 13)
!209 = !DILocation(line: 165, column: 13, scope: !201)
!210 = !DILocation(line: 167, column: 13, scope: !211)
!211 = distinct !DILexicalBlock(scope: !208, file: !1, line: 166, column: 4)
!212 = !DILocation(line: 167, column: 5, scope: !211)
!213 = !DILocation(line: 168, column: 4, scope: !211)
!214 = !DILocation(line: 170, column: 19, scope: !193)
!215 = !DILocation(line: 171, column: 16, scope: !193)
!216 = !DILocation(line: 176, column: 13, scope: !193)
!217 = !DILocation(line: 176, column: 10, scope: !193)
!218 = !DILocation(line: 177, column: 13, scope: !193)
!219 = !DILocation(line: 177, column: 10, scope: !193)
!220 = !DILocation(line: 178, column: 13, scope: !193)
!221 = !DILocation(line: 178, column: 10, scope: !193)
!222 = !DILocation(line: 179, column: 16, scope: !193)
!223 = !DILocation(line: 180, column: 3, scope: !193)
!224 = !DILocation(line: 153, column: 52, scope: !190)
!225 = !DILocation(line: 153, column: 3, scope: !190)
!226 = distinct !{!226, !191, !227, !98}
